Hi @esmaras ,

first of all: sorry for the late reply!

From reviewing the documentation and code I think the `routing_configuration` needs to be defined slightly different.

In your code I see

```hcl
 routing_configuration = [
   {
     agent_version = aws_bedrockagent_agent.chatbot_agent.agent_version
   }
 ]
```
Running some demo code using this snippet gives me the same error you mentioned

```shell
│ Inappropriate value for attribute "routing_configuration": element 0: attribute "provisioned_throughput" is required.
```

The correct usage seems to be (and we can have only up to max one of those blocks in the `aws_bedrockagent_agent_alias` resource)

```hcl
 routing_configuration {
    agent_version = aws_bedrockagent_agent.example.agent_version 
  }
```

`terraform plan` no longer fails, the resource is listed as below

```shell
 # aws_bedrockagent_agent_alias.example will be created
  + resource "aws_bedrockagent_agent_alias" "example" {
      + agent_alias_arn       = (known after apply)
      + agent_alias_id        = (known after apply)
      + agent_alias_name      = "my-agent-alias"
      + agent_id              = (known after apply)
      + description           = "Test Alias"
      + id                    = (known after apply)
      + region                = "us-west-2"
      + routing_configuration = [
          + {
              + agent_version = (known after apply)
            },
        ]
      + tags_all              = {}
    }
```